InformationRegisters/ИсторияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаС1САрхивом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремениБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьИсторияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьИсторияОбменаС1САрхивом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДанных</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСобытияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НаправленияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправленияОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УдалитьСобытияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УдалитьСобытияОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывДокументаИзАрхива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОтметкиДокументаКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтметкаДокументаКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УничтожениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПакетаДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СобытияОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИсторияОбменаС1САрхивом/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру-описание абстрактного события для записи в историю вызовом Добавить().
// 
// Параметры:
//   ИмяФайла - Строка - имя файла, с которым связано событие.
//   ЭтоЗагрузкаДанных - Булево - признак направления обмена.
//
// Возвращаемое значение:
//  Структура - содержит поля://   * Дата - Дата - дата события.
//   * ОсновнойОбъект - ЛюбаяСсылка, Неопределено - объект, по которому регистрируется событие.
//   * Объект - ЛюбаяСсылка, Неопределено - объект, по которому регистрируется событие.
//   * ТипСобытия - ПеречислениеСсылка.СобытияОбменаС1САрхивом, Неопределено - тип события.
//   * ИмяПользователя - Строка - имя пользователя, выполнившего событие.
//   * ИмяФайла - Строка - имя файла, с которым связано событие.
//   * КраткоеОписание - Строка - краткое описание события.
//   * Направление - ПеречислениеСсылка.НаправленияОбменаС1САрхивом, Неопределено - направление обмена.
//   * ДополнительныеСведения - Строка - дополнительные сведения о событии.
// 
Функция Событие(ИмяФайла = "", ЭтоЗагрузкаДанных = Истина) Экспорт
	
	Событие = Новый Структура;
	Событие.Вставить("Дата", Дата(1, 1, 1));
	Событие.Вставить("ОсновнойОбъект", Неопределено);
	Событие.Вставить("Объект", Неопределено);
	Событие.Вставить("ТипСобытия", Неопределено);
	Событие.Вставить("ИмяПользователя", ИмяТекущегоПользователяИБ());
	Событие.Вставить("ИмяФайла", ИмяФайла);
	Событие.Вставить("КраткоеОписание", "");
	Событие.Вставить("Направление", Неопределено);
	Событие.Вставить("ДополнительныеСведения", "");
	
	Событие.Направление = ?(ЭтоЗагрузкаДанных,
		Перечисления.НаправленияОбменаС1САрхивом.Получение, Перечисления.НаправленияОбменаС1САрхивом.Отправка);
	
	Возврат Событие;
	
КонецФункции

// Добавляет запись в историю.
//
// Параметры:
//  Событие - Структура - см Событие.
//
Процедура Добавить(Событие) Экспорт
	
	Если ЗначениеЗаполнено(Событие.Объект) И Не ЗначениеЗаполнено(Событие.ОсновнойОбъект) Тогда
		Событие.ОсновнойОбъект = Событие.Объект;
	КонецЕсли;
	Если ЗначениеЗаполнено(Событие.ОсновнойОбъект) И Не ЗначениеЗаполнено(Событие.Объект) Тогда
		Событие.Объект = Событие.ОсновнойОбъект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Событие.Дата) Тогда
		// Потребитель должен передать универсальную дату.
		Событие.Вставить("ОтметкаВремени", ОбменСАрхивом.ОтметкаВремениПоДате(Событие.Дата));
		Событие.Дата = МестноеВремя(Событие.Дата, ЧасовойПоясСеанса());
	Иначе
		Событие.Вставить("ОтметкаВремени", ОбменСАрхивом.ТекущаяОтметкаВремени());
		Событие.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДлинаКраткогоОписания = Метаданные.РегистрыСведений.ИсторияОбменаС1САрхивом.
		Ресурсы.КраткоеОписание.Тип.КвалификаторыСтроки.Длина;
	Если ДлинаКраткогоОписания < СтрДлина(Событие.КраткоеОписание)
			И Не ЗначениеЗаполнено(Событие.ДополнительныеСведения) Тогда
		Событие.ДополнительныеСведения = Событие.КраткоеОписание;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Событие);
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает признак наличия ошибок при последней попытке выгрузки описи.
//
// Параметры:
//  ПакетСсылка - СправочникСсылка.ПакетыДокументовДля1САрхива - пакет.
//
// Возвращаемое значение:
//  Булево - Истина, если есть ошибки.
// 
Функция ЕстьОшибкиВыгрузкиПакета(ПакетСсылка) Экспорт
	
	Условие = "История.ОсновнойОбъект = &ПакетСсылка";
	ПараметрыЗапроса = Новый Структура("ПакетСсылка", ПакетСсылка);
	
	Возврат ЕстьОшибкиПоУсловию(Условие, ПараметрыЗапроса);
	
КонецФункции

// Возвращает признак наличия ошибок при последней попытке загрузки файла.
//
// Параметры:
//  ИмяФайла - Строка - имя файла (не полное).
//
// Возвращаемое значение:
//  Булево - Истина, если есть ошибки.
// 
Функция ЕстьОшибкиЗагрузкиФайла(ИмяФайла) Экспорт
	
	Условие = "История.ИмяФайла = &ИмяФайла";
	ПараметрыЗапроса = Новый Структура("ИмяФайла", ИмяФайла);
	
	Возврат ЕстьОшибкиПоУсловию(Условие, ПараметрыЗапроса);
	
КонецФункции

// Проверяет, является ли объект основным (т.е. таким, который передается в отдельном файле при обмене).
//
// Параметры:
//  ТипСсылкиНаОбъект - Тип - тип ссылка на объект истории.
//
// Возвращаемое значение:
//  Булево - Истина, если объект является основным объектом обмена.
//
Функция ЭтоОсновнойОбъектОбмена(ТипСсылкиНаОбъект) Экспорт
	
	Возврат ТипСсылкиНаОбъект = Тип("СправочникСсылка.ПакетыДокументовДля1САрхива");
	
КонецФункции

// Проверяет, есть ли хотя бы одна запись по указанному объекту.
// 
// Параметры:
//  СсылкаНаОбъект - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - ссылка на объект.
//
// Возвращаемое значение:
//  Булево - признак наличия записей.
//
Функция ЕстьЗаписиПоОбъекту(СсылкаНаОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК История
		|ГДЕ
		|	История.ОсновнойОбъект В (&ОбъектыИстории)");
	
	ОбъектыИстории = ОбменСАрхивомВызовСервера.ОбъектыИсторииОбменаПоОбъекту(СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ОбъектыИстории", ОбъектыИстории);
	ЕстьЗаписи = Не Запрос.Выполнить().Пустой();
	
	Возврат ЕстьЗаписи;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Владелец)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область ОбработчикиОбновления

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом.ПолноеИмя();
	
	// Параметры выборки данных для многопоточного обновления.
	ПараметрыВыборки = Параметры.ПараметрыВыборки; // см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	История.ДатаСобытия КАК ДатаСобытия,
		|	История.ОбъектДанных КАК ОбъектДанных,
		|	История.Пользователь КАК Пользователь,
		|	История.ТипСобытия КАК ТипСобытия
		|ИЗ
		|	РегистрСведений.УдалитьИсторияОбменаС1САрхивом КАК История
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытия УБЫВ";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры,
		Запрос.Выполнить().Выгрузить(), ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыбранныеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ПлохиеДанные = Новый Соответствие;
	СостоянияБизнесПроцессов = Новый Соответствие;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом;
	ПолноеИмяОбъекта = МетаданныеРегистра.ПолноеИмя();
	
	Для Каждого Строка Из ВыбранныеДанные Цикл
		ПредставлениеОбъекта = Строка(Строка.ОбъектДанных);
		НачатьТранзакцию();
		Попытка
			
			ОтметкаВремени = ОбменСАрхивом.ОтметкаВремениПоДате(Строка.ДатаСобытия);
			ТипСобытия = ?(Строка.ТипСобытия = Перечисления.УдалитьСобытияОбменаС1САрхивом.ОшибкаОбмена,
				Перечисления.СобытияОбменаС1САрхивом.Ошибка, Перечисления.СобытияОбменаС1САрхивом.Информация);
			
			СтарыйНабор = РегистрыСведений.УдалитьИсторияОбменаС1САрхивом.СоздатьНаборЗаписей();
			СтарыйНабор.Отбор.ДатаСобытия.Установить(Строка.ДатаСобытия);
			СтарыйНабор.Отбор.ОбъектДанных.Установить(Строка.ОбъектДанных);
			СтарыйНабор.Отбор.Пользователь.Установить(Строка.Пользователь);
			СтарыйНабор.Отбор.ТипСобытия.Установить(Строка.ТипСобытия);
			СтарыйНабор.Прочитать();
			СтрокаСРесурсами = СтарыйНабор[0];
			
			НовыйНабор = РегистрыСведений.ИсторияОбменаС1САрхивом.СоздатьНаборЗаписей();
			НовыйНабор.Отбор.ОтметкаВремени.Установить(ОтметкаВремени);
			НовыйНабор.Отбор.ОсновнойОбъект.Установить(Строка.ОбъектДанных);
			НовыйНабор.Отбор.Объект.Установить(Строка.ОбъектДанных);
			НовыйНабор.Отбор.ТипСобытия.Установить(ТипСобытия);
			Запись = НовыйНабор.Добавить();
			Запись.ОтметкаВремени = ОтметкаВремени;
			Запись.ОсновнойОбъект = Строка.ОбъектДанных;
			Запись.Объект = Строка.ОбъектДанных;
			Запись.ТипСобытия = ТипСобытия;
			Запись.Дата = Строка.ДатаСобытия;
			Запись.ИмяПользователя = Строка(Строка.Пользователь);
			Запись.ИмяФайла = "";
			Запись.КраткоеОписание = ?(ЗначениеЗаполнено(СтрокаСРесурсами.ОписаниеСобытия),
				СтрокаСРесурсами.ОписаниеСобытия, СтрокаСРесурсами.ТипСобытия);
			Запись.Направление = Неопределено;
			Запись.ДополнительныеСведения = СтрокаСРесурсами.ДополнительныеСведения;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйНабор);
			
			СтарыйНабор.Очистить();
			СтарыйНабор.Записать();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтарыйНабор);
				
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Ошибка при обработке события объекта ""%1"" от %2: %3'"),
				ПредставлениеОбъекта,
				Строка.ДатаСобытия,
				Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбновлениеИнформационнойБазы.ЗаписатьСобытиеВЖурналРегистрации(ОписаниеОшибки,, Параметры);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Для Каждого НеобработанныйОбъект Из ПлохиеДанные Цикл
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(НеобработанныйОбъект.Ключ, НеобработанныйОбъект.Значение);
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать некоторые записи истории обмена с 1С:Архивом (пропущены): %1'"), 
			ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			МетаданныеРегистра,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обработана очередная порция записей истории обмена с 1С:Архивом: %1'"),
				ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьОшибкиПоУсловию(Условие, ПараметрыЗапроса)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтметкаНачалаПоследнейВыгрузки = "";
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(История.ОтметкаВремени), """") КАК ОтметкаВремени
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК История
		|ГДЕ
		|	&Условие
		|	И История.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.СобытияОбменаС1САрхивом.НачалоОбмена)");
	УсловиеДляВычисленияДатыНачала = Условие;
	Если Условие = "История.ИмяФайла = &ИмяФайла" Тогда
		УсловиеДляВычисленияДатыНачала = УсловиеДляВычисленияДатыНачала
			+ " И История.ОсновнойОбъект = НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", УсловиеДляВычисленияДатыНачала);
	Для Каждого КлючИЗначение Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОтметкаНачалаПоследнейВыгрузки = Выборка.ОтметкаВремени;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОтметкаНачалаПоследнейВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК История
		|ГДЕ
		|	&Условие
		|	И История.ОтметкаВремени >= &ОтметкаНачалаПоследнейВыгрузки
		|	И История.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.СобытияОбменаС1САрхивом.Ошибка)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	Запрос.УстановитьПараметр("ОтметкаНачалаПоследнейВыгрузки", ОтметкаНачалаПоследнейВыгрузки);
	ЕстьОшибки = Не Запрос.Выполнить().Пустой();
	
	Возврат ЕстьОшибки;
	
КонецФункции

Функция ИмяТекущегоПользователяИБ()
	
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ТекущийПользователь, "ИдентификаторПользователяИБ");
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ИдентификаторПользователяИБ);
	
	Если ПользовательИБ <> Неопределено Тогда
		Возврат ПользовательИБ.Имя; 
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
